from env.Role import Role


class Maker(Role):
    def name(self):
        return "maker"

    def system(self):
        return ("Тобі надається текст, який містить один або декілька через кому таких елементів:"
                  " '{'name:\"<назва>\",'description:\"<опис>\"'}'. Текст замість <назва> містить"
                  "назву функції, а замість <опис>  - опис функції. Уяви себе програмістом і напиши функції"
                "на мові Python. Кожен елемент містить назву і опис функції, яка має бути написана."
                "Кожна функція повина мати назву як назву у елементі. Функція повина мати документацію,"
                " причому на англійській мові. Для написання функцій можна використовувати "
                "бібліотеки Python, а також OpenAI API. Відповідь написати за таким форматом: "
                "'<бібліотеки>: <функції>'. Замість <бібліотеки> мають бути використані бібліотеки "
                "через кому. Замість <функції> має бути текст функцій. Якщо жодна бібліотека не потрібна,"
                "напиши замість <бібліотеки> 'libraries are not needed'")

    def _change_text(self, text):
        return text
