from env.Role import Role


class Maker(Role):
    def __init__(self):
        self.recode = False

    def system(self) -> str:
        if self.recode:
            return("Тобі надається текст, який містить функції , потім коментар '#-----------------',"
                   " потім тести. Ті тести показують, які помилки є у функціях. Уяви себе розробником, який "
                   "виправляє баги, маючи фуункції і тести, за допомогою яких тестували ті функції. Треба виправити"
                   "код функцій, щоб не було багів, через які спрацьовують тести. У відповідь вписати лише текст з "
                   "оновленими функціями. Документацію не міняти.")
        return ("Тобі надається текст, який містить один або декілька через кому таких елементів:"
                  " '{'name:\"<назва>\",'description:\"<опис>\"'}'. Текст замість <назва> містить"
                  "назву функції, а замість <опис>  - опис функції. Уяви себе програмістом і напиши функції"
                "на мові Python. Кожен елемент містить назву і опис функції, яка має бути написана."
                "Кожна функція повина мати назву як назву у елементі. Функція повина мати документацію,"
                " причому на англійській мові. Для написання функцій можна використовувати "
                "бібліотеки Python, а також OpenAI API. Відповідь потрібно написати за таким форматом: "
                "'<бібліотеки>: <функції>'. Замість <бібліотеки> мають бути використані бібліотеки "
                "через кому. Замість <функції> має бути текст функцій, який не містить нічого окрім самого"
                "коду і документації. Якщо жодна бібліотека не потрібна,"
                "напиши замість <бібліотеки> 'Немає бібліотек'")

    def _change_text(self, text: str) -> str:
        return text

    @property
    def libraries(self) -> list[str] | None:
        if not hasattr(self, '__libraries'):
            return None
        return self.__libraries

    def send_request(self, text: str) -> str:
        result = super().send_request(text)
        results = result.split(':', 1)
        if not (len(results) == 2):
            return result
        if results[0] == 'Немає бібліотек':
            self.__libraries = None
        else:
            self.__libraries = results[0].split(',')
        return result[1]
